In [1]:
a =[10,20,30]
b=[1,2,3]
print(a+b)

[10, 20, 30, 1, 2, 3]

In [2]:
result =[]
for i in range (3):
    result.append(a[i]+b[i])
  
print(result)

[11, 22, 33]

In [3]:
!pip install numpy
import numpy as np
a= np.array([10,20,30])
b= np.array([1,2,3])
print(a+b)

Requirement already satisfied: numpy in c:\users\lenovo\anaconda3\lib\site-packages (2.2.6)
[11 22 33]

In [4]:
import numpy as np
a= np.array([10,20.5,30])
# b= np.array([1,2,3])
print(a)
print(a.dtype)

[10.  20.5 30. ]
float64

In [5]:
# this is the implicit data typecasting in which the datatype is changed to the float 
import numpy as np
a= np.array([10,20.5,30])
b= np.array([1,2,3.0])
print(a+b)
print(a.dtype)

[11.  22.5 33. ]
float64

In [6]:
# print("min:",np.sub(a,b) there is no function for the addition and subtraction 
print("mean",np.mean(a))
print("mean",np.mean(b))
print("std dev:",np.std(a))
print("max:",np.max(a))
print("max:",np.max(b))
print("min:",np.min(a))
print("min:",np.min(b))
print(a.dtype)
print(b.dtype)

mean 20.166666666666668
mean 2.0
std dev: 8.16836716989523
max: 30.0
max: 3.0
min: 10.0
min: 1.0
float64
float64

In [7]:
!pip install pandas
import pandas as pd
# data = [1,2,3,5]

Requirement already satisfied: pandas in c:\users\lenovo\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [8]:
data = [1,2,3,4]

ser = pd.Series(data)
print(ser)
print(ser.index)
print(ser.values)
print(type(ser))

0    1
1    2
2    3
3    4
dtype: int64
RangeIndex(start=0, stop=4, step=1)
[1 2 3 4]
<class 'pandas.core.series.Series'>

In [9]:
data_2d = np.array([1, 2, 3 ,4.5, 5, 6, 7, 8, 9])
ser = pd.Series(data_2d)
print(data_2d)

print(ser[::3])

[1.  2.  3.  4.5 5.  6.  7.  8.  9. ]
0    1.0
3    4.5
6    7.0
dtype: float64

In [10]:
days= ["Mon","Tue","Wed","Thru","Fri","Sat","Sun"]
temps = ([30, 40, 50, 12, 35, 25, 10]) 

seq =pd.Series(temps , index =days) 
print(seq)
print(seq.iloc[1])
print(seq['Mon'])
print(seq[::3])
print(seq[:'Tue'])

print(seq.head())
print("first 3",seq.head(3))


print("-------------",seq.head())
print("-------------",seq.tail())

Mon     30
Tue     40
Wed     50
Thru    12
Fri     35
Sat     25
Sun     10
dtype: int64
40
30
Mon     30
Thru    12
Sun     10
dtype: int64
Mon    30
Tue    40
dtype: int64
Mon     30
Tue     40
Wed     50
Thru    12
Fri     35
dtype: int64
first 3 Mon    30
Tue    40
Wed    50
dtype: int64
------------- Mon     30
Tue     40
Wed     50
Thru    12
Fri     35
dtype: int64
------------- Wed     50
Thru    12
Fri     35
Sat     25
Sun     10
dtype: int64


Now this is going to be the dataframe on the CSV

In [20]:
# !import numpy

arr = np.array([[1,2],[3,4],[5,6]])

df_np = pd.DataFrame(arr, columns = ['Col1','Col2'])
print(df_np)

   Col1  Col2
0     1     2
1     3     4
2     5     6

In [24]:
data = {
    'Name':['Amit','Rahul','Priya'],
    'Maths':[78,75,100],
    'Science':[100,45,78]
}

df = pd.DataFrame(data)
print(df)

    Name  Maths  Science
0   Amit     78      100
1  Rahul     75       45
2  Priya    100       78

In [27]:
df['Name'] 
# type(df)

0     Amit
1    Rahul
2    Priya
Name: Name, dtype: object

In [28]:
df['Maths']

0     78
1     75
2    100
Name: Maths, dtype: int64

In [29]:
df['Science']

0    100
1     45
2     78
Name: Science, dtype: int64

In [30]:
df.head()

    Name  Maths  Science
0   Amit     78      100
1  Rahul     75       45
2  Priya    100       78

In [35]:
df.iloc[1,2]

np.int64(45)

In [36]:
df.shape

(3, 3)

In [41]:
# df.columns
df.dtypes

Name       object
Maths       int64
Science     int64
dtype: object

In [66]:
# df.rename(columns = {'Mathematics' : 'science'}, inplace = True)
df.columns.values[1] = 'Mathematics'

In [67]:
df

    Name  Mathematics  science  Total  Percentage
0   Amit           78      100    178        89.0
1  Rahul           75       45    120        60.0
2  Priya          100       78    178        89.0

In [73]:
df['Total'] = df['Mathematics'] + df['science']
df['Percentage'] = ((df['Mathematics'] + df['science'])/200)*100

In [74]:
df.columns

Index(['Name', 'Mathematics', 'science', 'Total', 'Percentage'], dtype='object')

In [81]:
df

    Name  Mathematics  science  Total  Percentage
0   Amit           78      100    178        89.0
1  Rahul           75       45    120        60.0
2  Priya          100       78    178        89.0

In [90]:
df.sort_values(by ='Percentage')

    Name  Mathematics  science  Total  Percentage
1  Rahul           75       45    120        60.0
0   Amit           78      100    178        89.0
2  Priya          100       78    178        89.0

In [92]:
df.sort_values(by ='Percentage',ascending = False)

    Name  Mathematics  science  Total  Percentage
1  Rahul           75       45    120        60.0
0   Amit           78      100    178        89.0
2  Priya          100       78    178        89.0

In [99]:
df.drop('total',axis = 1, inplace = True)

KeyError: "['total'] not found in axis"

In [100]:
df

    Name  Mathematics  Total  Percentage
1  Rahul           75    120        60.0
0   Amit           78    178        89.0
2  Priya          100    178        89.0